<a href="https://colab.research.google.com/github/toyeiei/jetbrains-python/blob/master/Intro_to_Python_and_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Intro to Python**

In [ ]:
# basic calculation
print(1 + 1)
print(10 - 3)
print(2 * 5)
print(6 / 2)
print(6 ** 2)

2
7
10
3.0
36

In [ ]:
# create variables
income = 6500
expense = 3200
saving = income - expense 
print(saving)

3300

In [ ]:
print(income)

6500

In [ ]:
# print string (characters, text)
print("Hello World")
print('Hello World')

Hello World
Hello World

In [ ]:
# concat string
print("Hello " + "David!")

Hello David!

In [ ]:
# fstring template
name = "Toy"
age = 25

text = f"Hi my name is {name}. I am {age} years old."

print(text)

Hi my name is Toy. I am 25 years old.

In [ ]:
# data types
print(type(100))
print(type(176.2))
print(type("Toy"))
print(type(True)) # False

<class 'int'>
<class 'float'>
<class 'str'>
<class 'bool'>

In [ ]:
# compare values
print(1 + 1 == 200)
print("Hello" == "Hello")
print(10 * 2 <= 20) # not equal !=

False
True
True

In [ ]:
# create a new list
friends = ['John', 'David', 'Marry', 'Anna', 'Beckham']
print(friends)

['John', 'David', 'Marry', 'Anna', 'Beckham']

In [ ]:
# index on pthon starts with zero (0)
print(friends[0])
print(friends[1])
print(friends[2])
print(friends[-1])
print(friends[-2])
print(friends[0:3]) # does not include the last value (3)
print(friends[2: ])

John
David
Marry
Beckham
Anna
['John', 'David', 'Marry']
['Marry', 'Anna', 'Beckham']

In [ ]:
# add more friends to the list
friends = friends + ['Ronaldo', 'Messi']
print(friends)

['John', 'David', 'Marry', 'Anna', 'Beckham', 'Ronaldo', 'Messi']

In [ ]:
# len(): length
print(len(friends))

7

In [ ]:
# method = functions designed specifically for that type/class/object
friends.append("Halal")
print(friends)

['John', 'David', 'Marry', 'Anna', 'Beckham', 'Ronaldo', 'Messi', 'Halal']

In [ ]:
# list method 
friends.remove('David')
print(friends)

['John', 'Marry', 'Anna', 'Beckham', 'Ronaldo', 'Messi', 'Halal']

In [ ]:
# sort list
friends.sort(reverse=False)
print(friends)

['Anna', 'Beckham', 'Halal', 'John', 'Marry', 'Messi', 'Ronaldo']

In [ ]:
# create dictionary
customers = {
    "name": "David",
    "age": 28,
    "gender": "male",
    "top_three_movies": ["The Dark Knight", "Spiderman", "Avengers"]
}

print(customers)

{'name': 'David', 'age': 28, 'gender': 'male', 'top_three_movies': ['The Dark Knight', 'Spiderman', 'Avengers']}

In [ ]:
# get values from dictionary
print(customers["name"])
print(customers["age"])
print(customers["top_three_movies"][2])

David
28
Avengers

In [ ]:
# update values in dictionary
# mutable object
customers['name'] = 'Davidson'
customers['age'] = 32
customers

{'age': 32,
 'gender': 'male',
 'name': 'Davidson',
 'top_three_movies': ['The Dark Knight', 'Spiderman', 'Avengers']}

In [ ]:
# check if key exists
'gpa' in customers

False

In [ ]:
# define function
def greeting(name):
    print("Hello World! " + name)    

# test function
greeting("Toy")

Hello World! Toy

In [ ]:
# define a function
def greeting2(name, age):
    return f"{name} is {age} years old!"

In [ ]:
text = greeting2("Toy", 32)
print(text)

Toy is 32 years old!

In [ ]:
# define a new function to assign grade
def grader(score):
    if score >= 80:
        return "Passed"
    else:
        return "Failed"

In [ ]:
result = grader(95)
print(result)

Passed

In [ ]:
# for loop
for friend in friends:
    print("Hello " + friend)

Hello Anna
Hello Beckham
Hello Halal
Hello John
Hello Marry
Hello Messi
Hello Ronaldo

# **Intro to OOP**

Object Oriented Programming

In [ ]:
# create new class / object
class Apple:
    color = ""
    flavour = ""
    price = 0
    # method 
    def make_some_noise(self):
        print("I am very delicious!")
    
    def update_price(self, new_price):
        self.price = new_price

In [ ]:
# create instance
jonagold = Apple()

In [ ]:
# create attribute
jonagold.color = "red"
jonagold.flavour = "sweet"
jonagold.price = 100

In [ ]:
# print value/ attributes
print(jonagold.color)
print(jonagold.flavour)
print(jonagold.price)

red
sweet
100

In [ ]:
# call method
jonagold.make_some_noise()

I am very delicious!

In [ ]:
# call update price
jonagold.update_price(350)

In [ ]:
print(jonagold.price)

350

# **Intro to Pandas**

In [ ]:
# import pandas module
import pandas as pd
import numpy as np

In [ ]:
# create a new dataframe from scratch
student_dict = {
    "id": [1, 2, 3, 4, 5],
    "name": ["David", "John", "Marry", "Anna", "Beckham"],
    "gender": ["male", "male", "female", "female", "male"],
    "passed_exam": [True, True, True, False, False]
}

student_dict

{'gender': ['male', 'male', 'female', 'female', 'male'],
 'id': [1, 2, 3, 4, 5],
 'name': ['David', 'John', 'Marry', 'Anna', 'Beckham'],
 'passed_exam': [True, True, True, False, False]}

In [ ]:
students = pd.DataFrame(student_dict)
students

   id     name  gender  passed_exam
0   1    David    male         True
1   2     John    male         True
2   3    Marry  female         True
3   4     Anna  female        False
4   5  Beckham    male        False

In [ ]:
# filter male students
students[ students['gender'] == 'male' ]

   id     name gender  passed_exam
0   1    David   male         True
1   2     John   male         True
4   5  Beckham   male        False

In [ ]:
# filter female students
students[ students['gender'] == 'female' ]

   id   name  gender  passed_exam
2   3  Marry  female         True
3   4   Anna  female        False

In [ ]:
# query method
students.query("(passed_exam == False) and (gender == 'female')")

   id  name  gender  passed_exam
3   4  Anna  female        False

In [ ]:
# select columns
students[ ['name', 'gender', 'passed_exam'] ]

      name  gender  passed_exam
0    David    male         True
1     John    male         True
2    Marry  female         True
3     Anna  female        False
4  Beckham    male        False

In [ ]:
# read csv file
penguins = pd.read_csv("penguins.csv")

In [ ]:
# head file
penguins.head()

  species     island  bill_length_mm  ...  body_mass_g     sex  year
0  Adelie  Torgersen            39.1  ...       3750.0    male  2007
1  Adelie  Torgersen            39.5  ...       3800.0  female  2007
2  Adelie  Torgersen            40.3  ...       3250.0  female  2007
3  Adelie  Torgersen             NaN  ...          NaN     NaN  2007
4  Adelie  Torgersen            36.7  ...       3450.0  female  2007

[5 rows x 8 columns]

In [ ]:
# tail 
penguins.tail()

       species island  bill_length_mm  ...  body_mass_g     sex  year
339  Chinstrap  Dream            55.8  ...       4000.0    male  2009
340  Chinstrap  Dream            43.5  ...       3400.0  female  2009
341  Chinstrap  Dream            49.6  ...       3775.0    male  2009
342  Chinstrap  Dream            50.8  ...       4100.0    male  2009
343  Chinstrap  Dream            50.2  ...       3775.0  female  2009

[5 rows x 8 columns]

In [ ]:
# shape
penguins.shape

(344, 8)

In [ ]:
# info dataframe
penguins.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
 7   year               344 non-null    int64
dtypes: float64(4), int64(1), object(3)
memory usage: 21.6+ KB

In [ ]:
# check missing values in each column
penguins.isnull().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [ ]:
# drop na = remove every rows with missing values NaN
penguins = penguins.dropna()
penguins.isnull().sum()

species              0
island               0
bill_length_mm       0
bill_depth_mm        0
flipper_length_mm    0
body_mass_g          0
sex                  0
year                 0
dtype: int64

In [ ]:
# summary stats
penguins['body_mass_g'].describe()

count     333.000000
mean     4207.057057
std       805.215802
min      2700.000000
25%      3550.000000
50%      4050.000000
75%      4775.000000
max      6300.000000
Name: body_mass_g, dtype: float64

In [ ]:
# create new column
penguins.head()

  species     island  bill_length_mm  ...  body_mass_g     sex  year
0  Adelie  Torgersen            39.1  ...       3750.0    male  2007
1  Adelie  Torgersen            39.5  ...       3800.0  female  2007
2  Adelie  Torgersen            40.3  ...       3250.0  female  2007
4  Adelie  Torgersen            36.7  ...       3450.0  female  2007
5  Adelie  Torgersen            39.3  ...       3650.0    male  2007

[5 rows x 8 columns]

In [ ]:
penguins['avg_bill_mm'] = (penguins['bill_length_mm'] + penguins['bill_depth_mm']) / 2 
penguins.head()

  species     island  bill_length_mm  ...     sex  year  avg_bill_mm
0  Adelie  Torgersen            39.1  ...    male  2007        28.90
1  Adelie  Torgersen            39.5  ...  female  2007        28.45
2  Adelie  Torgersen            40.3  ...  female  2007        29.15
4  Adelie  Torgersen            36.7  ...  female  2007        28.00
5  Adelie  Torgersen            39.3  ...    male  2007        29.95

[5 rows x 9 columns]

In [ ]:
penguins.tail()

       species island  bill_length_mm  ...     sex  year  avg_bill_mm
339  Chinstrap  Dream            55.8  ...    male  2009        37.80
340  Chinstrap  Dream            43.5  ...  female  2009        30.80
341  Chinstrap  Dream            49.6  ...    male  2009        33.90
342  Chinstrap  Dream            50.8  ...    male  2009        34.90
343  Chinstrap  Dream            50.2  ...  female  2009        34.45

[5 rows x 9 columns]

In [ ]:
# write file csv
penguins.to_csv("complete_penguins.csv")